
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущСтрока.Сумма = ТекущСтрока.Количество * ТекущСтрока.Цена;
КонецПроцедуры     

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущСтрока.Сумма = ТекущСтрока.Количество * ТекущСтрока.Цена;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекущСтрока = Элементы.Товары.ТекущиеДанные; 
	Если НЕ ТекущСтрока.Количество = 0 Тогда	
		ТекущСтрока.Цена = ТекущСтрока.Сумма / ТекущСтрока.Количество;	
	Иначе  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите Количество";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

